<template>
  <div class="about">
    <h1>人类高质量电影</h1>
    <p>这是一个关于人类高质量电影的介绍。。。</p>
    <p>简单来说，这是一个电影库项目，你可以注册自己的账户并建立自己的电影库，当你想看电影的时候可以使用选电影功能，后台会根据算法帮你选择电影出来。</p>
    <h3>为什么想要做这个项目？</h3>
    <p>
      我本身是一个电影爱好者，因为收藏了很多电影且都没有看过（相信很多电影爱好者都有这个“习惯”，收藏==看了），甚至有一些还没来及收藏就忘了，所以做了这样一个可以收藏并选电影的东西。
      选电影算法的灵感是来自于力扣，我本身并不擅长前端，所以这也是一个练手的项目，应该会经常崩溃，希望大家轻点用。。。
    </p>
    <h2>功能介绍</h2>
    我并不确定界面做的是否一目了然（看了就会用），所以这里还是对一些关键功能做一个介绍，有任何问题或建议欢迎联系我，微信<b>perfectlover_liu</b>
    <h3>批量导入</h3>
    <p>当您的电影库很大时，您可以不必一个一个的手动创建，而是使用批量导入功能。点击批量导入按钮会出现以下对话框：</p>
    <el-image
      style="width: 639px; height: 332px"
      :src="require('../assets/bulk_import.png')"
      :fit="fill"></el-image>
    <p>请先下载模板，按模板中的格式填入电影后再导入，即可批量导入。</p>
    <p>注意:<b>不要修改模板中的表头！</b>否则可能会导致解析失败。</p>
    <h3>选电影功能</h3>
    <p>
      这个功能可以说是这个项目的灵感，设想这样一个场景：
    </p>
    <p>
      在某个周六的晚上，你想花2~3个小时的时间来欣赏一部电影，繁忙的工作已经占据了你大部分的时间，甚至你连今天都在加班，
      所以你并不想随便找一部低分电影，看完让你感觉浪费了2~3小时的生命。</p>
    <p>
      然而你打开某某视频APP的收藏夹里面躺着几十上百部电影，你又犯了选择困难症，大部分电影都感觉一般，想看的电影时间又太长...
    </p>
    <p>
      这时候选电影就派上用场了，点击<b>选电影</b>选项卡来到以下界面：
    </p>
    <el-image
      style="width: 500px; height: 128px"
      :src="require('../assets/pick_movie.png')"
      :fit="fill"></el-image>
    <p>在第一栏中输入你想花多长时间来看电影，比如180分钟，其次还可以根据电影类型和演员来筛选，然后点击pick！</p>
    <p>后台会从你电影库中<b>没看过的</b>电影里面，综合电影时长、评分、喜爱程度、类型和演员帮你选出一部或多部电影，如下图所示：</p>
    <el-image
      style="width: 1280px; height: 271px"
      :src="require('../assets/pick_result.png')"
      :fit="fill"></el-image>
    <p>
      假定评分*喜爱程度，为你能获得的快乐值，即这部电影你越想看而且它的评分越高，你看完之后获取的快乐值越大。
    </p>
    <p>
      那么抽象成算法就是：在设定的时长内，选出评分*喜爱程度最大的组合，题目已经呼之欲出了。。。
    </p>
    <h3>联系我</h3>
    <p>个人微信搜索<b>perfectlover_liu</b>，或扫码：</p>
    <el-image
      style="width: 200px; height: 200px"
      :src="require('../assets/mmqrcode1636910105044.png')"
      :fit="fill"></el-image>
  </div>
</template>

<style scoped>
.about {
  text-align: left;
  margin-top: 10px;
  margin-left: 20px;
  margin-bottom: 60px;
}
</style>
